# GetAllUsedItemFiles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllUsedItemFiles Method
FabricationConfiguration Class See Also
---
Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationItemFile> GetAllUsedItemFiles()
```

Visual Basic
---
```text
Public Function GetAllUsedItemFiles As IList(Of FabricationItemFile)
```

Visual C++
---
```text
public:
IList<FabricationItemFile^>^ GetAllUsedItemFiles()
```

# ### Return Value
All the used fabrication item files.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace